# Predicting Electricity Consumption in Toronto: Comparing Machine Learning to Time Series Forecasting
**Group:** G16

**By:** Greta Avetisian and Cesare Spinoso-Di Piano

In [1]:
import pandas as pd
import numpy as np
from datetime import timedelta

## Loading in all relevant datasets
Here are the sources for the Independent Electricity System Operator (IESO) data:
- [Demand](http://reports.ieso.ca/public/Demand/)
- [Demand_Zonal](http://reports.ieso.ca/public/DemandZonal/)
- [Price](http://reports.ieso.ca/public/PriceHOEPPredispOR/)

We will be working within the 2004-2018 inclusive year range, because we suspect 15 years of recent hourly data to be enough for our needs.

In [2]:
# Creating a variable for our studied time range
yearRange = range(2004, 2019) #The range doesn't include the stop number

In [3]:
# Reading all the Demand data files and storing them in a dataframe(df) object
for i in yearRange:
    locals()["Demand_" + str(i)] = pd.read_csv("Data/Demand/PUB_Demand_" + str(i) + ".csv", header = 3)

In [4]:
# Since this is an hourly data set, it is expected for all datasets to have the same
#number of rows except the leap year which will have an extra 24 rows for the extra
#24 hours that occur within that year.
for i in yearRange:
    print(len(locals()["Demand_" + str(i)]), i)

8784 2004
8760 2005
8760 2006
8760 2007
8784 2008
8760 2009
8760 2010
8760 2011
8784 2012
8760 2013
8760 2014
8760 2015
8784 2016
8760 2017
8760 2018

In [5]:
#Printing out 2004 to see if it worked for the first instance of Demand
Demand_2004

            Date  Hour  Market Demand  Ontario Demand
0     2004-01-01     1          15787           14703
1     2004-01-01     2          15194           14130
2     2004-01-01     3          14589           13575
3     2004-01-01     4          14294           13280
4     2004-01-01     5          14233           13219
...          ...   ...            ...             ...
8779  2004-12-31    20          19547           18131
8780  2004-12-31    21          18918           17390
8781  2004-12-31    22          18439           16737
8782  2004-12-31    23          17718           16112
8783  2004-12-31    24          17057           15677

[8784 rows x 4 columns]

In [6]:
#Printing out 2018 to see if it worked for the last instance of Demand
Demand_2018

            Date  Hour  Market Demand  Ontario Demand
0     2018-01-01     1          18974           16627
1     2018-01-01     2          18447           16084
2     2018-01-01     3          18453           15866
3     2018-01-01     4          18662           15725
4     2018-01-01     5          18060           15470
...          ...   ...            ...             ...
8755  2018-12-31    20          18276           16195
8756  2018-12-31    21          18046           15668
8757  2018-12-31    22          17516           14987
8758  2018-12-31    23          17506           14560
8759  2018-12-31    24          16704           13828

[8760 rows x 4 columns]

In [7]:
#Repeating the previous process for Zonal_Demand
for i in yearRange:
    locals()["Zonal_Demand_" + str(i)] = pd.read_csv("Data/Zonal_Demand/PUB_DemandZonal_" + str(i) + ".csv", header = 3)

In [8]:
# Since this is an hourly data set, it is expected for all datasets to have the same
#number of rows except the leap year which will have an extra 24 rows for the extra
#24 hours that occur within that year.
for i in yearRange:
    print(len(locals()["Zonal_Demand_" + str(i)]), i)

8784 2004
8760 2005
8760 2006
8760 2007
8784 2008
8760 2009
8760 2010
8760 2011
8784 2012
8760 2013
8760 2014
8760 2015
8784 2016
8760 2017
8760 2018

In [9]:
#Printing out 2004 to see if it worked for the first instance of Zonal Demand
Zonal_Demand_2004

            Date  Hour  Ontario Demand  ...  West  Zone Total  Diff
0     2004-01-01     1           14703  ...  1670       14837   134
1     2004-01-01     2           14130  ...  1603       14231   101
2     2004-01-01     3           13575  ...  1553       13675   100
3     2004-01-01     4           13280  ...  1512       13382   102
4     2004-01-01     5           13219  ...  1501       13259    40
...          ...   ...             ...  ...   ...         ...   ...
8779  2004-12-31    20           18131  ...  1934       18127    -4
8780  2004-12-31    21           17390  ...  1874       17397     7
8781  2004-12-31    22           16737  ...  1825       16743     6
8782  2004-12-31    23           16112  ...  1766       16198    86
8783  2004-12-31    24           15677  ...  1705       15735    58

[8784 rows x 15 columns]

In [10]:
#Printing out 2018 to see if it worked for the last instance of Zonal Demand
Zonal_Demand_2018

            Date  Hour  Ontario Demand  ...  West  Zone Total  Diff
0     2018-01-01     1           16627  ...  1489       16522  -105
1     2018-01-01     2           16084  ...  1465       16086     2
2     2018-01-01     3           15866  ...  1441       15862    -4
3     2018-01-01     4           15725  ...  1413       15614  -112
4     2018-01-01     5           15470  ...  1391       15522    51
...          ...   ...             ...  ...   ...         ...   ...
8755  2018-12-31    20           16195  ...  1462       16302   107
8756  2018-12-31    21           15668  ...  1421       15811   143
8757  2018-12-31    22           14987  ...  1321       15162   175
8758  2018-12-31    23           14560  ...  1249       14577    17
8759  2018-12-31    24           13828  ...  1206       13951   123

[8760 rows x 15 columns]

In [11]:
#Repeating the previous process for Price
for i in yearRange:
    locals()["Price_" + str(i)] = pd.read_csv("Data/Price/PUB_PriceHOEPPredispOR_" + str(i) + ".csv", header = 3)

In [12]:
# Since this is an hourly data set, it is expected for all datasets to have the same
#number of rows except the leap year which will have an extra 24 rows for the extra
#24 hours that occur within that year.
for i in yearRange:
    print(len(locals()["Price_" + str(i)]), i)

8784 2004
8760 2005
8760 2006
8760 2007
8784 2008
8760 2009
8760 2010
8760 2011
8784 2012
8760 2013
8760 2014
8760 2015
8784 2016
8760 2017
8760 2018

In [13]:
#Printing out 2004 to see if it worked for the first instance of Price
Price_2004

            Date  Hour   HOEP  ...  OR 10 Min Sync  OR 10 Min non-sync  OR 30 Min
0     2004-01-01     1  30.90  ...             NaN                 NaN        NaN
1     2004-01-01     2  27.13  ...             NaN                 NaN        NaN
2     2004-01-01     3  25.23  ...             NaN                 NaN        NaN
3     2004-01-01     4  24.29  ...             NaN                 NaN        NaN
4     2004-01-01     5  24.42  ...             NaN                 NaN        NaN
...          ...   ...    ...  ...             ...                 ...        ...
8779  2004-12-31    20  31.15  ...             NaN                 NaN        NaN
8780  2004-12-31    21  27.08  ...             NaN                 NaN        NaN
8781  2004-12-31    22  26.72  ...             NaN                 NaN        NaN
8782  2004-12-31    23  31.97  ...             NaN                 NaN        NaN
8783  2004-12-31    24  23.89  ...             NaN                 NaN        NaN

[8784 rows x 9 columns]

In [14]:
#Printing out 2018 to see if it worked for the last instance of Price
Price_2018

            Date  Hour   HOEP  ...  OR 10 Min Sync  OR 10 Min non-sync  OR 30 Min
0     2018-01-01     1  51.29  ...            0.20                0.20       0.19
1     2018-01-01     2  43.59  ...            0.20                0.20       0.20
2     2018-01-01     3  93.60  ...            0.25                0.25       0.22
3     2018-01-01     4  54.78  ...            0.20                0.20       0.20
4     2018-01-01     5  14.35  ...            0.20                0.20       0.20
...          ...   ...    ...  ...             ...                 ...        ...
8755  2018-12-31    20   5.62  ...            1.44                1.44       1.44
8756  2018-12-31    21   8.95  ...            1.24                1.24       1.24
8757  2018-12-31    22   5.81  ...            0.45                0.20       0.20
8758  2018-12-31    23   2.87  ...            1.26                0.19       0.15
8759  2018-12-31    24   0.00  ...            1.27                0.19       0.10

[8760 rows x 9 columns]

## Stacking All the Years Together for each Category of Data
Essentially, within this section, we want to take all the individual yearly files of data we created for each category and merge them into a single one by stacking them vertically. Thus we will have a variable for each category that holds all of the 2004-2018 data.

In [15]:
#Stacking all the Demand dataframes
#We're lucky that all of these dataframes are formatted in the same way,
#so no further data manipulation is required.
Demand = Demand_2004
for i in yearRange[1:]:
    Demand = pd.concat([Demand, locals()["Demand_" + str(i)]], axis = 0)

In [16]:
Demand

            Date  Hour  Market Demand  Ontario Demand
0     2004-01-01     1          15787           14703
1     2004-01-01     2          15194           14130
2     2004-01-01     3          14589           13575
3     2004-01-01     4          14294           13280
4     2004-01-01     5          14233           13219
...          ...   ...            ...             ...
8755  2018-12-31    20          18276           16195
8756  2018-12-31    21          18046           15668
8757  2018-12-31    22          17516           14987
8758  2018-12-31    23          17506           14560
8759  2018-12-31    24          16704           13828

[131496 rows x 4 columns]

In [17]:
#Stacking all the Zonal_Demand dataframes
#We're lucky that all of these dataframes are formatted in the same way,
#so no further data manipulation is required.
Zonal_Demand = Zonal_Demand_2004
for i in yearRange[1:]:
    Zonal_Demand = pd.concat([Zonal_Demand, locals()["Zonal_Demand_" + str(i)]], axis = 0)

In [18]:
Zonal_Demand

            Date  Hour  Ontario Demand  ...  West  Zone Total  Diff
0     2004-01-01     1           14703  ...  1670       14837   134
1     2004-01-01     2           14130  ...  1603       14231   101
2     2004-01-01     3           13575  ...  1553       13675   100
3     2004-01-01     4           13280  ...  1512       13382   102
4     2004-01-01     5           13219  ...  1501       13259    40
...          ...   ...             ...  ...   ...         ...   ...
8755  2018-12-31    20           16195  ...  1462       16302   107
8756  2018-12-31    21           15668  ...  1421       15811   143
8757  2018-12-31    22           14987  ...  1321       15162   175
8758  2018-12-31    23           14560  ...  1249       14577    17
8759  2018-12-31    24           13828  ...  1206       13951   123

[131496 rows x 15 columns]

In [19]:
#Stacking all the Zonal_Demand dataframes
#We're lucky that all of these dataframes are formatted in the same way, so no further data manipulation is required.
Price = Price_2004
for i in yearRange[1:]:
    Price = pd.concat([Price, locals()["Price_" + str(i)]], axis = 0)

In [20]:
Price

            Date  Hour   HOEP  ... OR 10 Min Sync OR 10 Min non-sync OR 30 Min
0     2004-01-01     1   30.9  ...            NaN                NaN       NaN
1     2004-01-01     2  27.13  ...            NaN                NaN       NaN
2     2004-01-01     3  25.23  ...            NaN                NaN       NaN
3     2004-01-01     4  24.29  ...            NaN                NaN       NaN
4     2004-01-01     5  24.42  ...            NaN                NaN       NaN
...          ...   ...    ...  ...            ...                ...       ...
8755  2018-12-31    20   5.62  ...           1.44               1.44      1.44
8756  2018-12-31    21   8.95  ...           1.24               1.24      1.24
8757  2018-12-31    22   5.81  ...           0.45               0.20      0.20
8758  2018-12-31    23   2.87  ...           1.26               0.19      0.15
8759  2018-12-31    24      0  ...           1.27               0.19      0.10

[131496 rows x 9 columns]

## Joining All the Electricity Categories Together into a Single Dataframe
Taking the newly created Demand, Zonal_Demand and Price dataframes and merging them into a single dataframe that will represent all the electricity related data.

In [21]:
#Checking that all our Date/Hour columns are exactly the same to see if we can simply merge these dataframes horizontally
print("Demand & Zonal_Demand have the same Date column: ", (Demand['Date']).equals(Zonal_Demand['Date']))
print("Demand & Price have the same Date column: ", (Demand['Date']).equals(Price['Date']))
print("Price & Zonal_Demand have the same Date column: ", (Price['Date']).equals(Zonal_Demand['Date']))
print("Demand & Zonal_Demand have the same Hour column: ", (Demand['Hour']).equals(Zonal_Demand['Hour']))
print("Demand & Price have the same Hour column: ", (Demand['Hour']).equals(Price['Hour']))
print("Price & Zonal_Demand have the same Hour column: ", (Price['Hour']).equals(Zonal_Demand['Hour']))

Demand & Zonal_Demand have the same Date column:  True
Demand & Price have the same Date column:  True
Price & Zonal_Demand have the same Date column:  True
Demand & Zonal_Demand have the same Hour column:  True
Demand & Price have the same Hour column:  True
Price & Zonal_Demand have the same Hour column:  True

In [22]:
# Since they're all true, we perform a horizontal stack & remove the common
#columns we are aware of from the 2nd & 3rd df.
Electricity = pd.concat([Demand,
                         Zonal_Demand.drop(['Date', 'Hour', 'Ontario Demand'], axis=1),
                         Price.drop(['Date', 'Hour'], axis=1)], axis = 1, join='inner')

In [23]:
#Printing the Electricity dataframe just to take a glance.
Electricity

            Date  Hour  ...  OR 10 Min non-sync  OR 30 Min
0     2004-01-01     1  ...                 NaN        NaN
1     2004-01-01     2  ...                 NaN        NaN
2     2004-01-01     3  ...                 NaN        NaN
3     2004-01-01     4  ...                 NaN        NaN
4     2004-01-01     5  ...                 NaN        NaN
...          ...   ...  ...                 ...        ...
8755  2018-12-31    20  ...                1.44       1.44
8756  2018-12-31    21  ...                1.24       1.24
8757  2018-12-31    22  ...                0.20       0.20
8758  2018-12-31    23  ...                0.19       0.15
8759  2018-12-31    24  ...                0.19       0.10

[131496 rows x 23 columns]

## Inspecting  and Manipulating the Columns in Electricity
By manipulating, we mean removing those that are unnecessary to our work.

In [24]:
#Printing out all the columns Electricity currently holds.
Electricity.columns

Index(['Date', 'Hour', 'Market Demand', 'Ontario Demand', 'Northwest',
       'Northeast', 'Ottawa', 'East', 'Toronto', 'Essa', 'Bruce', 'Southwest',
       'Niagara', 'West', 'Zone Total', 'Diff', 'HOEP', 'Hour 1 Predispatch',
       'Hour 2 Predispatch', 'Hour 3 Predispatch', 'OR 10 Min Sync',
       'OR 10 Min non-sync', 'OR 30 Min'],
      dtype='object')

In [25]:
#Only keeping the columns we need for our study
Electricity = Electricity[['Date', 'Hour', 'Toronto', 'HOEP']]

In [26]:
#Exporting the electricity data set to csv.
Electricity.to_csv('IesoMerged.csv', index=False)

## Loading the Weather Data
Here is the weather data we are using:
- [Weather](https://www.renewables.ninja/)

On the website, we simply type 'Toronto' in the search bar, navigate to the 'Weather' section where we select our year of interest and check all the checkboxes. Then we click on 'Run'. This will produce a message box that will pop-up from where we can download the data in a csv format.
Unfortunately, we have to repeat this step for each year in our interest of range, but the data is pretty complete.
Once again,we will be working within the 2004-2018 inclusive year range, because we suspect 15 years of recent hourly data to be enough for our needs.

In [27]:
for i in range(2004, 2020): #2020, because the files are UTC based, so 2019 still has 2018 local_time data:
    locals()["weather_" + str(i)] = pd.read_csv("Data/Weather/ninja_weather_43.6535_-79.3839_" + str(i) + ".csv", header = 3)

## Stacking All the Years Together for Weather
Within this section, we want to take all the individual annual weather files and merge them into a single one by stacking them vertically.

In [28]:
weather = weather_2004
for i in range(2005, 2020):
    weather = pd.concat([weather, locals()["weather_" + str(i)]], axis = 0)

In [29]:
weather

                  time        local_time  ...  radiation_toa  cloud_cover
0     2004-01-01 00:00  2003-12-31 19:00  ...          0.000        0.039
1     2004-01-01 01:00  2003-12-31 20:00  ...          0.000        0.035
2     2004-01-01 02:00  2003-12-31 21:00  ...          0.000        0.033
3     2004-01-01 03:00  2003-12-31 22:00  ...          0.000        0.064
4     2004-01-01 04:00  2003-12-31 23:00  ...          0.000        0.094
...                ...               ...  ...            ...          ...
8755  2019-12-31 19:00  2019-12-31 14:00  ...        400.510        0.902
8756  2019-12-31 20:00  2019-12-31 15:00  ...        241.941        0.825
8757  2019-12-31 21:00  2019-12-31 16:00  ...         51.768        0.824
8758  2019-12-31 22:00  2019-12-31 17:00  ...          0.000        0.748
8759  2019-12-31 23:00  2019-12-31 18:00  ...          0.000        0.496

[140256 rows x 10 columns]

## Redefining the Weather Dataset to Only Keep What we Need

In [30]:
#Redefining the first two columns to be datetime
weather = weather.astype({'time': 'datetime64[ns]', 'local_time': 'datetime64[ns]'})

In [31]:
#Subsetting the dataframe for only the years that are relevant to us (2004-2018)
weather = weather[(weather['local_time'].dt.year > 2003) & (weather['local_time'].dt.year < 2019)]
#Also need to reindex the dataframe
weather = weather.reset_index(drop=True)
weather

                      time          local_time  ...  radiation_toa  cloud_cover
0      2004-01-01 05:00:00 2004-01-01 00:00:00  ...            0.0        0.118
1      2004-01-01 06:00:00 2004-01-01 01:00:00  ...            0.0        0.148
2      2004-01-01 07:00:00 2004-01-01 02:00:00  ...            0.0        0.144
3      2004-01-01 08:00:00 2004-01-01 03:00:00  ...            0.0        0.159
4      2004-01-01 09:00:00 2004-01-01 04:00:00  ...            0.0        0.194
...                    ...                 ...  ...            ...          ...
131491 2019-01-01 00:00:00 2018-12-31 19:00:00  ...            0.0        0.988
131492 2019-01-01 01:00:00 2018-12-31 20:00:00  ...            0.0        0.981
131493 2019-01-01 02:00:00 2018-12-31 21:00:00  ...            0.0        0.985
131494 2019-01-01 03:00:00 2018-12-31 22:00:00  ...            0.0        0.990
131495 2019-01-01 04:00:00 2018-12-31 23:00:00  ...            0.0        0.986

[131496 rows x 10 columns]

In [32]:
#Checking that we only have the relevvant years
weather['local_time'].dt.year.unique()

array([2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014,
       2015, 2016, 2017, 2018])

In [33]:
#Checking that we have the same number of rows as our Electricity dataset
len(Electricity) == len(weather)

True

In [34]:
#Reseting indexes for both dataframes
weather = weather.reset_index(drop=True)
Electricity = Electricity.reset_index(drop=True)

In [35]:
#Merging both datasets to create a single huge dataset
mergedDataset = pd.concat([Electricity, weather], axis = 1)

In [36]:
mergedDataset["Date"] = pd.to_datetime(mergedDataset["Date"], format="%Y-%m-%d").astype(np.str)
mergedDataset["Hour"] = mergedDataset["Hour"].apply(lambda x: timedelta(seconds=int((x-1)*60*60))).astype(np.str).apply(lambda x: x.replace("0 days", "")).apply(lambda x: x.replace("1 days", "")) # couldn't find a better way
mergedDataset.insert(2, "Datetime", pd.to_datetime(mergedDataset["Date"] + ' ' + mergedDataset["Hour"]))

In [37]:
#Dropping the weather time related columns since we created a main one using 'Date' & 'Hour'.
mergedDataset = mergedDataset.drop(['time', 'local_time'], axis=1)

In [38]:
mergedDataset

              Date       Hour  ... radiation_toa  cloud_cover
0       2004-01-01   00:00:00  ...           0.0        0.118
1       2004-01-01   01:00:00  ...           0.0        0.148
2       2004-01-01   02:00:00  ...           0.0        0.144
3       2004-01-01   03:00:00  ...           0.0        0.159
4       2004-01-01   04:00:00  ...           0.0        0.194
...            ...        ...  ...           ...          ...
131491  2018-12-31   19:00:00  ...           0.0        0.988
131492  2018-12-31   20:00:00  ...           0.0        0.981
131493  2018-12-31   21:00:00  ...           0.0        0.985
131494  2018-12-31   22:00:00  ...           0.0        0.990
131495  2018-12-31   23:00:00  ...           0.0        0.986

[131496 rows x 13 columns]

In [39]:
mergedDataset.to_csv('MergedDataset.csv')

## Adding columns for isWeekend and isHoliday
We think that the week day and wether or not it's a holiday will affect our study. Therefore, we decided to add these two attributes to the dataset.

In [40]:
#Checking for the appropriate datetime object we can use to add these new attributes
mergedDataset.dtypes

Date                         object
Hour                         object
Datetime             datetime64[ns]
Toronto                       int64
HOEP                         object
temperature                 float64
precipitation               float64
snowfall                    float64
snow_mass                   float64
air_density                 float64
radiation_surface           float64
radiation_toa               float64
cloud_cover                 float64
dtype: object

In [41]:
#Column 'HOEP' in reality is a float
#(Some numbers use a comma for the thousand seperator which is why it interprets it as a string object instead.)
mergedDataset['HOEP'] = mergedDataset['HOEP'].apply(lambda x: float(str(x).replace(',', '')) if ',' in str(x) else float(str(x)))

mergedDataset.dtypes

Date                         object
Hour                         object
Datetime             datetime64[ns]
Toronto                       int64
HOEP                        float64
temperature                 float64
precipitation               float64
snowfall                    float64
snow_mass                   float64
air_density                 float64
radiation_surface           float64
radiation_toa               float64
cloud_cover                 float64
dtype: object

In [42]:
#Adding a column for isWeekend 
#dayofweek returns a number from 0-6 where 5 & 6 respectively represent Saturday and Sunday
mergedDataset['isWeekend'] = mergedDataset['Datetime'].dt.dayofweek.isin([5, 6])
mergedDataset['isWeekend'].replace({False: 0, True: 1}, inplace = True)
mergedDataset['isWeekend'] = mergedDataset['isWeekend'].astype('category')
mergedDataset['isWeekend']

0         0
1         0
2         0
3         0
4         0
         ..
131491    0
131492    0
131493    0
131494    0
131495    0
Name: isWeekend, Length: 131496, dtype: category
Categories (2, int64): [0, 1]

In [43]:
#Dealing with holidays now
#Installing the following holiday library https://pypi.org/project/holidays/
!pip install holidays

Requirement already satisfied: holidays in /usr/local/lib/python3.6/dist-packages (0.10.3)
Requirement already satisfied: convertdate in /usr/local/lib/python3.6/dist-packages (from holidays) (2.3.0)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.6/dist-packages (from holidays) (2.8.1)
Requirement already satisfied: korean-lunar-calendar in /usr/local/lib/python3.6/dist-packages (from holidays) (0.2.1)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from holidays) (1.15.0)
Requirement already satisfied: pymeeus<=1,>=0.3.6 in /usr/local/lib/python3.6/dist-packages (from convertdate->holidays) (0.3.7)
Requirement already satisfied: pytz>=2014.10 in /usr/local/lib/python3.6/dist-packages (from convertdate->holidays) (2018.9)

In [44]:
#Importing the newly added library
import holidays

In [45]:
Toronto_Holidays = holidays.Canada(prov = 'ON', years = mergedDataset['Datetime'].dt.year.unique())
print('There are ', len(Toronto_Holidays), ' holidays (days) in the year range we selected.')
print('There should be ', len(Toronto_Holidays) * 24, ' rows that are true for isHoliday.')

There are  161  holidays (days) in the year range we selected.
There should be  3864  rows that are true for isHoliday.

In [46]:
#Printing out the holidays for a year to make sure it's legit
for date, name in sorted(Toronto_Holidays.items()):
    print(date, name)

2004-01-01 New Year's Day
2004-04-09 Good Friday
2004-05-24 Victoria Day
2004-07-01 Canada Day
2004-08-02 Civic Holiday
2004-09-06 Labour Day
2004-10-11 Thanksgiving
2004-12-24 Christmas Day (Observed)
2004-12-25 Christmas Day
2004-12-27 Boxing Day (Observed)
2004-12-31 New Year's Day (Observed)
2005-01-01 New Year's Day
2005-03-25 Good Friday
2005-05-23 Victoria Day
2005-07-01 Canada Day
2005-08-01 Civic Holiday
2005-09-05 Labour Day
2005-10-10 Thanksgiving
2005-12-25 Christmas Day
2005-12-26 Christmas Day (Observed)
2005-12-27 Boxing Day (Observed)
2006-01-01 New Year's Day
2006-01-02 New Year's Day (Observed)
2006-04-14 Good Friday
2006-05-22 Victoria Day
2006-07-01 Canada Day
2006-07-03 Canada Day (Observed)
2006-08-07 Civic Holiday
2006-09-04 Labour Day
2006-10-09 Thanksgiving
2006-12-25 Christmas Day
2006-12-26 Boxing Day
2007-01-01 New Year's Day
2007-04-06 Good Friday
2007-05-21 Victoria Day
2007-07-01 Canada Day
2007-07-02 Canada Day (Observed)
2007-08-06 Civic Holiday
2007-09-03 Labour Day
2007-10-08 Thanksgiving
2007-12-25 Christmas Day
2007-12-26 Boxing Day
2008-01-01 New Year's Day
2008-02-18 Family Day
2008-03-21 Good Friday
2008-05-19 Victoria Day
2008-07-01 Canada Day
2008-08-04 Civic Holiday
2008-09-01 Labour Day
2008-10-13 Thanksgiving
2008-12-25 Christmas Day
2008-12-26 Boxing Day
2009-01-01 New Year's Day
2009-02-16 Family Day
2009-04-10 Good Friday
2009-05-18 Victoria Day
2009-07-01 Canada Day
2009-08-03 Civic Holiday
2009-09-07 Labour Day
2009-10-12 Thanksgiving
2009-12-25 Christmas Day
2009-12-28 Boxing Day (Observed)
2010-01-01 New Year's Day
2010-02-15 Family Day
2010-04-02 Good Friday
2010-05-24 Victoria Day
2010-07-01 Canada Day
2010-08-02 Civic Holiday
2010-09-06 Labour Day
2010-10-11 Thanksgiving
2010-12-24 Christmas Day (Observed)
2010-12-25 Christmas Day
2010-12-27 Boxing Day (Observed)
2010-12-31 New Year's Day (Observed)
2011-01-01 New Year's Day
2011-02-21 Family Day
2011-04-22 Good Friday
2011-05-23 Victoria Day
2011-07-01 Canada Day
2011-08-01 Civic Holiday
2011-09-05 Labour Day
2011-10-10 Thanksgiving
2011-12-25 Christmas Day
2011-12-26 Christmas Day (Observed)
2011-12-27 Boxing Day (Observed)
2012-01-01 New Year's Day
2012-01-02 New Year's Day (Observed)
2012-02-20 Family Day
2012-04-06 Good Friday
2012-05-21 Victoria Day
2012-07-01 Canada Day
2012-07-02 Canada Day (Observed)
2012-08-06 Civic Holiday
2012-09-03 Labour Day
2012-10-08 Thanksgiving
2012-12-25 Christmas Day
2012-12-26 Boxing Day
2013-01-01 New Year's Day
2013-02-18 Family Day
2013-03-29 Good Friday
2013-05-20 Victoria Day
2013-07-01 Canada Day
2013-08-05 Civic Holiday
2013-09-02 Labour Day
2013-10-14 Thanksgiving
2013-12-25 Christmas Day
2013-12-26 Boxing Day
2014-01-01 New Year's Day
2014-02-17 Family Day
2014-04-18 Good Friday
2014-05-19 Victoria Day
2014-07-01 Canada Day
2014-08-04 Civic Holiday
2014-09-01 Labour Day
2014-10-13 Thanksgiving
2014-12-25 Christmas Day
2014-12-26 Boxing Day
2015-01-01 New Year's Day
2015-02-16 Family Day
2015-04-03 Good Friday
2015-05-18 Victoria Day
2015-07-01 Canada Day
2015-08-03 Civic Holiday
2015-09-07 Labour Day
2015-10-12 Thanksgiving
2015-12-25 Christmas Day
2015-12-28 Boxing Day (Observed)
2016-01-01 New Year's Day
2016-02-15 Family Day
2016-03-25 Good Friday
2016-05-23 Victoria Day
2016-07-01 Canada Day
2016-08-01 Civic Holiday
2016-09-05 Labour Day
2016-10-10 Thanksgiving
2016-12-25 Christmas Day
2016-12-26 Christmas Day (Observed)
2016-12-27 Boxing Day (Observed)
2017-01-01 New Year's Day
2017-01-02 New Year's Day (Observed)
2017-02-20 Family Day
2017-04-14 Good Friday
2017-05-22 Victoria Day
2017-07-01 Canada Day
2017-07-03 Canada Day (Observed)
2017-08-07 Civic Holiday
2017-09-04 Labour Day
2017-10-09 Thanksgiving
2017-12-25 Christmas Day
2017-12-26 Boxing Day
2018-01-01 New Year's Day
2018-02-19 Family Day
2018-03-30 Good Friday
2018-05-21 Victoria Day
2018-07-01 Canada Day
2018-07-02 Canada Day (Observed)
2018-08-06 Civic Holiday
2018-09-03 Labour Day
2018-10-08 Thanksgiving
2018-12-25 Christmas Day
2018-12-26 Boxing Day

In [47]:
#Adding the isHoliday column
mergedDataset['isHoliday'] = mergedDataset['Datetime'].dt.date.isin(Toronto_Holidays)

In [48]:
mergedDataset[mergedDataset['isHoliday'] == True]

              Date       Hour  ... isWeekend  isHoliday
0       2004-01-01   00:00:00  ...         0       True
1       2004-01-01   01:00:00  ...         0       True
2       2004-01-01   02:00:00  ...         0       True
3       2004-01-01   03:00:00  ...         0       True
4       2004-01-01   04:00:00  ...         0       True
...            ...        ...  ...       ...        ...
131371  2018-12-26   19:00:00  ...         0       True
131372  2018-12-26   20:00:00  ...         0       True
131373  2018-12-26   21:00:00  ...         0       True
131374  2018-12-26   22:00:00  ...         0       True
131375  2018-12-26   23:00:00  ...         0       True

[3864 rows x 15 columns]

In [49]:
mergedDataset['isHoliday'].replace({False: 0, True: 1}, inplace = True)
mergedDataset['isHoliday'] = mergedDataset['isHoliday'].astype('category')
mergedDataset['isHoliday']

0         1
1         1
2         1
3         1
4         1
         ..
131491    0
131492    0
131493    0
131494    0
131495    0
Name: isHoliday, Length: 131496, dtype: category
Categories (2, int64): [0, 1]

In [50]:
mergedDataset.head(25)

          Date       Hour            Datetime  ...  cloud_cover  isWeekend  isHoliday
0   2004-01-01   00:00:00 2004-01-01 00:00:00  ...        0.118          0          1
1   2004-01-01   01:00:00 2004-01-01 01:00:00  ...        0.148          0          1
2   2004-01-01   02:00:00 2004-01-01 02:00:00  ...        0.144          0          1
3   2004-01-01   03:00:00 2004-01-01 03:00:00  ...        0.159          0          1
4   2004-01-01   04:00:00 2004-01-01 04:00:00  ...        0.194          0          1
5   2004-01-01   05:00:00 2004-01-01 05:00:00  ...        0.137          0          1
6   2004-01-01   06:00:00 2004-01-01 06:00:00  ...        0.124          0          1
7   2004-01-01   07:00:00 2004-01-01 07:00:00  ...        0.131          0          1
8   2004-01-01   08:00:00 2004-01-01 08:00:00  ...        0.126          0          1
9   2004-01-01   09:00:00 2004-01-01 09:00:00  ...        0.131          0          1
10  2004-01-01   10:00:00 2004-01-01 10:00:00  ...        0.210          0          1
11  2004-01-01   11:00:00 2004-01-01 11:00:00  ...        0.600          0          1
12  2004-01-01   12:00:00 2004-01-01 12:00:00  ...        0.943          0          1
13  2004-01-01   13:00:00 2004-01-01 13:00:00  ...        0.991          0          1
14  2004-01-01   14:00:00 2004-01-01 14:00:00  ...        0.992          0          1
15  2004-01-01   15:00:00 2004-01-01 15:00:00  ...        0.992          0          1
16  2004-01-01   16:00:00 2004-01-01 16:00:00  ...        0.993          0          1
17  2004-01-01   17:00:00 2004-01-01 17:00:00  ...        0.990          0          1
18  2004-01-01   18:00:00 2004-01-01 18:00:00  ...        0.973          0          1
19  2004-01-01   19:00:00 2004-01-01 19:00:00  ...        0.974          0          1
20  2004-01-01   20:00:00 2004-01-01 20:00:00  ...        0.985          0          1
21  2004-01-01   21:00:00 2004-01-01 21:00:00  ...        0.989          0          1
22  2004-01-01   22:00:00 2004-01-01 22:00:00  ...        0.988          0          1
23  2004-01-01   23:00:00 2004-01-01 23:00:00  ...        0.993          0          1
24  2004-01-02   00:00:00 2004-01-02 00:00:00  ...        0.994          0          0

[25 rows x 15 columns]

In [51]:
#Reconvert our table to csv
mergedDataset.to_csv('MergedDataset.csv', index=False)